In [4]:
print("Hello world")

Hello world

### Data Types

In [5]:
#Integer
x = 5
y = -10

In [6]:
#Float 
a = 1.5
b = -0.5

In [8]:
#String
name = "Alice"
greeting = "Hello, World!"

In [9]:
#Boolean
# English
is_active = True
is_admin = False

In [11]:
# List:
fruits = ["apple", "banana", "cherry"]

In [12]:
#Tuple
coordinates = (10, 20)

In [14]:
#Dictionary
person = {"name": "Alice", "age": 25}

In [15]:
print(person)

{'name': 'Alice', 'age': 25}

In [16]:
#Set
unique_numbers = {1, 2, 3}

### Loop

In [17]:
#For Loop
for i in range(5):
    print(i)

0
1
2
3
4

In [18]:
#While Loop
i = 0
while i < 5:
    print(i)
    i += 1

0
1
2
3
4

### Function

In [3]:
# English
def greet(name):
    return f"Hello, {name}"
print(greet("Jawad"))

Hello, Jawad

In [5]:
# English
def is_even(number):
    return number % 2 == 0

number = 13
if is_even(number):
    print(f"{number} is even")
else:
    print(f"{number} is odd")

13 is odd

### class

In [7]:
class Person:
    def __init__(self, name, age):
        self.name = name
        self.age = age

    def greet(self):
        return f"Hello, my name is {self.name} and I am {self.age} years old."

person1 = Person("jawad", 20)
print(person1.greet())

Hello, my name is jawad and I am 20 years old.

### pandas

In [33]:
!pip install pandas

Requirement already satisfied: pandas in d:\users\pc\anaconda3\lib\site-packages (2.1.4)
Requirement already satisfied: numpy<2,>=1.23.2 in d:\users\pc\anaconda3\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in d:\users\pc\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in d:\users\pc\anaconda3\lib\site-packages (from pandas) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.1 in d:\users\pc\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in d:\users\pc\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [9]:
import pandas as pd

In [22]:
df=pd.read_csv('livestock.csv')

In [23]:
df

,STATISTIC Label,Year,Type of Animal,Region,UNIT,VALUE
0,Number of Livestock in June,2015,Total cattle,State,000 Head,6963.5
1,Number of Livestock in June,2015,Total cattle,Northern and Western,000 Head,1723.9
2,Number of Livestock in June,2015,Total cattle,Border,000 Head,793.6
3,Number of Livestock in June,2015,Total cattle,West,000 Head,930.2
4,Number of Livestock in June,2015,Total cattle,Southern,000 Head,3750.1
...,...,...,...,...,...,...
3658,Number of Livestock in June,2023,Total farmed deer,South-East,000 Head,NaN
3659,Number of Livestock in June,2023,Total farmed deer,South-West,000 Head,NaN
3660,Number of Livestock in June,2023,Total farmed deer,Eastern and Midland,000 Head,NaN
3661,Number of Livestock in June,2023,Total farmed deer,Dublin and Mid-East,000 Head,NaN
3662,Number of Livestock in June,2023,Total farmed deer,Midland,000 Head,NaN

In [24]:
df.head()

,STATISTIC Label,Year,Type of Animal,Region,UNIT,VALUE
0,Number of Livestock in June,2015,Total cattle,State,000 Head,6963.5
1,Number of Livestock in June,2015,Total cattle,Northern and Western,000 Head,1723.9
2,Number of Livestock in June,2015,Total cattle,Border,000 Head,793.6
3,Number of Livestock in June,2015,Total cattle,West,000 Head,930.2
4,Number of Livestock in June,2015,Total cattle,Southern,000 Head,3750.1

In [25]:
df.tail()

,STATISTIC Label,Year,Type of Animal,Region,UNIT,VALUE
3658,Number of Livestock in June,2023,Total farmed deer,South-East,000 Head,NaN
3659,Number of Livestock in June,2023,Total farmed deer,South-West,000 Head,NaN
3660,Number of Livestock in June,2023,Total farmed deer,Eastern and Midland,000 Head,NaN
3661,Number of Livestock in June,2023,Total farmed deer,Dublin and Mid-East,000 Head,NaN
3662,Number of Livestock in June,2023,Total farmed deer,Midland,000 Head,NaN

In [26]:
df.shape

(3663, 6)

In [27]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3663 entries, 0 to 3662
Data columns (total 6 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   STATISTIC Label  3663 non-null   object
 1   Year             3663 non-null   int64
 2   Type of Animal   3663 non-null   object
 3   Region           3663 non-null   object
 4   UNIT             3663 non-null   object
 5   VALUE            3278 non-null   float64
dtypes: float64(1), int64(1), object(4)
memory usage: 171.8+ KB

In [28]:
df.isnull()

      STATISTIC Label   Year  Type of Animal  Region   UNIT  VALUE
0               False  False           False   False  False  False
1               False  False           False   False  False  False
2               False  False           False   False  False  False
3               False  False           False   False  False  False
4               False  False           False   False  False  False
...               ...    ...             ...     ...    ...    ...
3658            False  False           False   False  False   True
3659            False  False           False   False  False   True
3660            False  False           False   False  False   True
3661            False  False           False   False  False   True
3662            False  False           False   False  False   True

[3663 rows x 6 columns]

In [30]:
df.isnull().sum()

STATISTIC Label      0
Year                 0
Type of Animal       0
Region               0
UNIT                 0
VALUE              385
dtype: int64